In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv("USA_cars_datasets.csv")

In [ ]:
df

      Unnamed: 0  price      brand  ...        lot       state country
0              0   6300     toyota  ...  159348797  new jersey     usa
1              1   2899       ford  ...  166951262   tennessee     usa
2              2   5350      dodge  ...  167655728     georgia     usa
3              3  25000       ford  ...  167753855    virginia     usa
4              4  27700  chevrolet  ...  167763266     florida     usa
...          ...    ...        ...  ...        ...         ...     ...
2494        2494   7800     nissan  ...  167722715  california     usa
2495        2495   9200     nissan  ...  167762225     florida     usa
2496        2496   9200     nissan  ...  167762226     florida     usa
2497        2497   9200     nissan  ...  167762227     florida     usa
2498        2498   9200     nissan  ...  167762228     florida     usa

[2499 rows x 11 columns]

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df.head()

   Unnamed: 0  price      brand  ...       state  country      condition
0           0   6300     toyota  ...  new jersey      usa   10 days left
1           1   2899       ford  ...   tennessee      usa    6 days left
2           2   5350      dodge  ...     georgia      usa    2 days left
3           3  25000       ford  ...    virginia      usa  22 hours left
4           4  27700  chevrolet  ...     florida      usa  22 hours left

[5 rows x 13 columns]

In [ ]:
df.head(2)

   Unnamed: 0  price   brand  ...       state  country     condition
0           0   6300  toyota  ...  new jersey      usa  10 days left
1           1   2899    ford  ...   tennessee      usa   6 days left

[2 rows x 13 columns]

In [ ]:
df['price']

0        6300
1        2899
2        5350
3       25000
4       27700
        ...
2494     7800
2495     9200
2496     9200
2497     9200
2498     9200
Name: price, Length: 2499, dtype: int64

In [ ]:
df.isnull()

      Unnamed: 0  price  brand  model  ...    lot  state  country  condition
0          False  False  False  False  ...  False  False    False      False
1          False  False  False  False  ...  False  False    False      False
2          False  False  False  False  ...  False  False    False      False
3          False  False  False  False  ...  False  False    False      False
4          False  False  False  False  ...  False  False    False      False
...          ...    ...    ...    ...  ...    ...    ...      ...        ...
2494       False  False  False  False  ...  False  False    False      False
2495       False  False  False  False  ...  False  False    False      False
2496       False  False  False  False  ...  False  False    False      False
2497       False  False  False  False  ...  False  False    False      False
2498       False  False  False  False  ...  False  False    False      False

[2499 rows x 13 columns]

In [ ]:
df.isnull().sum()

Unnamed: 0      0
price           0
brand           0
model           0
year            0
title_status    0
mileage         0
color           0
vin             0
lot             0
state           0
country         0
condition       0
dtype: int64

In [ ]:
df['brand']

0          toyota
1            ford
2           dodge
3            ford
4       chevrolet
          ...
2494       nissan
2495       nissan
2496       nissan
2497       nissan
2498       nissan
Name: brand, Length: 2499, dtype: object

In [ ]:
df['brand'].unique()

array(['toyota', 'ford', 'dodge', 'chevrolet', 'gmc', 'chrysler', 'kia',
       'buick', 'infiniti', 'mercedes-benz', 'jeep', 'bmw', 'cadillac',
       'hyundai', 'mazda', 'honda', 'heartland', 'jaguar', 'acura',
       'harley-davidson', 'audi', 'lincoln', 'lexus', 'nissan', 'land',
       'maserati', 'peterbilt', 'ram'], dtype=object)

In [ ]:
len(df['brand'].unique())

28

In [ ]:
df['model'].unique()

array(['cruiser', 'se', 'mpv', 'door', '1500', 'pk', 'malibu', 'coupe',
       'wagon', 'forte', 'encore', 'sorento', 'doors', 'chassis', 'q70',
       'camaro', 'convertible', 'vans', 'srw', 'compass', 'enclave',
       '300', 'cherokee', 'pacifica', 'x3', 'equinox', 'challenger', 'm',
       'colorado', 'focus', 'durango', 'escape', 'charger', 'explorer',
       'f-150', '3500', 'caravan', 'van', 'dart', '2500', 'esv',
       'cutaway', 'el', 'edge', 'series', 'flex', 'srx', 'cab', 'pickup',
       'vehicl', 'trax', 'tahoe', 'suburban', 'cargo', 'drw', 'fiesta',
       'impala', 'soul', 'elantra', 'pioneer', 'trail', 'traverse',
       'country', 'sundance', 'road/street', 'nautilus', 'gx', 'q5',
       'gle', 'sportage', '5', 'sport', 'discovery', 'acadia', 'ghibli',
       'glc', 'e-class', 'truck', 'utility', 'limited', 'sl-class',
       'cx-3', '2500hd', 'sonic', 'corvette', 'mdx', 'xt5', 'fusion',
       'mustang', 'passenger', 'volt', 'spark', 'cruze', 'ld', 'journey',
       'transit', 'ranger', 'taurus', 'max', 'energi', 'expedition',
       'bus', 'ecosport', 'f-750', 'd', 'dr', 'hybrid', 'suv', 'connect',
       'f-650', 'sentra', 'altima', 'frontier', 'rogue', 'maxima',
       'versa', 'note', 'armada', 'pathfinder', 'titan', 'sedan', 'juke',
       'murano', 'xterra', 'kicks', 'xd', 'nvp'], dtype=object)

In [ ]:
df['year'].unique()

array([2008, 2011, 2018, 2014, 2010, 2017, 2009, 2013, 2015, 2020, 2016,
       1973, 2003, 2019, 2002, 2000, 2001, 2005, 2012, 2006, 2007, 1998,
       2004, 1994, 1997, 1996, 1999, 1984, 1995, 1993])

In [ ]:
#similarly we can go to column title_status, color, state , country and so on...

# TO FIND OUT AVERAGE, FOLLOW BELLOW CODES---
df['price'].sum()

46900411

In [ ]:
len(df['price'])

2499

In [ ]:
#So, divide above to codes
df['price'].sum()/len(df['price'])

18767.671468587436

In [ ]:
# In Integer form
df['price'].sum()//len(df['price'])

18767

In [ ]:
# To  delete a column

df.head()

   Unnamed: 0  price      brand    model  ...   color        lot       state country
0           0   6300     toyota  cruiser  ...   black  159348797  new jersey     usa
1           1   2899       ford       se  ...  silver  166951262   tennessee     usa
2           2   5350      dodge      mpv  ...  silver  167655728     georgia     usa
3           3  25000       ford     door  ...    blue  167753855    virginia     usa
4           4  27700  chevrolet     1500  ...     red  167763266     florida     usa

[5 rows x 11 columns]

In [ ]:
del df['mileage']

In [ ]:
df.head()

   Unnamed: 0  price      brand  ...   color       state country
0           0   6300     toyota  ...   black  new jersey     usa
1           1   2899       ford  ...  silver   tennessee     usa
2           2   5350      dodge  ...  silver     georgia     usa
3           3  25000       ford  ...    blue    virginia     usa
4           4  27700  chevrolet  ...     red     florida     usa

[5 rows x 9 columns]

In [ ]:
df['price'].max()

84900

In [ ]:
df['brand']== 'toyota'

0        True
1       False
2       False
3       False
4       False
        ...
2494    False
2495    False
2496    False
2497    False
2498    False
Name: brand, Length: 2499, dtype: bool

In [ ]:
df[df['brand']== 'toyota']

   Unnamed: 0  price   brand    model  ...   title_status  color       state country
0           0   6300  toyota  cruiser  ...  clean vehicle  black  new jersey     usa

[1 rows x 9 columns]

In [ ]:
df[df['brand']== 'dodge']

      Unnamed: 0  price  brand  ...     color           state country
2              2   5350  dodge  ...    silver         georgia     usa
5              5   5700  dodge  ...     white           texas     usa
10            10  10400  dodge  ...    orange         georgia     usa
48            48   5580  dodge  ...      gray           texas     usa
94            94  39800  dodge  ...     white    pennsylvania     usa
...          ...    ...    ...  ...       ...             ...     ...
1193        1193  23900  dodge  ...     white         georgia     usa
1194        1194  14500  dodge  ...  no_color         florida     usa
1195        1195  23000  dodge  ...      gray        virginia     usa
1196        1196  15000  dodge  ...       red  north carolina     usa
1197        1197  15000  dodge  ...     white  north carolina     usa

[432 rows x 9 columns]

In [ ]:
df[df['brand']== 'ford']

      Unnamed: 0  price brand  ...     color           state country
1              1   2899  ford  ...    silver       tennessee     usa
3              3  25000  ford  ...      blue        virginia     usa
9              9   5250  ford  ...     black           texas     usa
14            14  20700  ford  ...     black        virginia     usa
18            18   5210  ford  ...     white           texas     usa
...          ...    ...   ...  ...       ...             ...     ...
2199        2199  13800  ford  ...     white  north carolina     usa
2200        2200  56000  ford  ...     black    pennsylvania     usa
2201        2201  13800  ford  ...    silver  north carolina     usa
2202        2202  45800  ford  ...     white    pennsylvania     usa
2203        2203  13800  ford  ...  no_color  north carolina     usa

[1235 rows x 9 columns]

In [ ]:
len(df[df['brand']== 'ford'])

1235

In [ ]:
for brand in df['brand'].unique():
  print(brand, ":",len(df[df['brand']== brand]))

toyota : 1
ford : 1235
dodge : 432
chevrolet : 297
gmc : 42
chrysler : 18
kia : 13
buick : 13
infiniti : 12
mercedes-benz : 10
jeep : 30
bmw : 17
cadillac : 10
hyundai : 15
mazda : 2
honda : 12
heartland : 5
jaguar : 1
acura : 3
harley-davidson : 1
audi : 4
lincoln : 2
lexus : 2
nissan : 312
land : 4
maserati : 1
peterbilt : 4
ram : 1

In [ ]:
for model in df['model'].unique():
  print(model, ":",len(df[df['model']== model]))

cruiser : 1
se : 1
mpv : 87
door : 651
1500 : 39
pk : 5
malibu : 12
coupe : 6
wagon : 30
forte : 2
encore : 3
sorento : 5
doors : 148
chassis : 4
q70 : 1
camaro : 6
convertible : 1
vans : 2
srw : 38
compass : 6
enclave : 2
300 : 6
cherokee : 3
pacifica : 3
x3 : 2
equinox : 18
challenger : 44
m : 1
colorado : 12
focus : 9
durango : 64
escape : 39
charger : 42
explorer : 39
f-150 : 219
3500 : 4
caravan : 102
van : 46
dart : 1
2500 : 8
esv : 1
cutaway : 12
el : 3
edge : 34
series : 8
flex : 33
srx : 1
cab : 8
pickup : 15
vehicl : 1
trax : 8
tahoe : 9
suburban : 16
cargo : 2
drw : 10
fiesta : 14
impala : 12
soul : 1
elantra : 1
pioneer : 1
trail : 1
traverse : 6
country : 2
sundance : 1
road/street : 1
nautilus : 1
gx : 1
q5 : 1
gle : 2
sportage : 1
5 : 1
sport : 40
discovery : 1
acadia : 1
ghibli : 1
glc : 1
e-class : 1
truck : 4
utility : 1
limited : 1
sl-class : 1
cx-3 : 1
2500hd : 1
sonic : 2
corvette : 4
mdx : 1
xt5 : 1
fusion : 65
mustang : 29
passenger : 3
volt : 2
spark : 1
cruze : 2
ld : 3
journey : 61
transit : 41
ranger : 6
taurus : 10
max : 41
energi : 1
expedition : 28
bus : 2
ecosport : 7
f-750 : 1
d : 2
dr : 1
hybrid : 5
suv : 1
connect : 1
f-650 : 3
sentra : 28
altima : 21
frontier : 14
rogue : 54
maxima : 3
versa : 34
note : 2
armada : 4
pathfinder : 22
titan : 5
sedan : 4
juke : 1
murano : 5
xterra : 1
kicks : 1
xd : 1
nvp : 1

In [ ]:
for clr in df['color'].unique():
  print(clr, ":",len(df[df['color']== clr]))

black : 516
silver : 300
blue : 151
red : 192
white : 707
gray : 395
orange : 20
brown : 15
no_color : 61
gold : 19
charcoal : 18
turquoise : 1
beige : 5
green : 24
dark blue : 1
maroon : 1
phantom black : 1
yellow : 9
color: : 5
light blue : 1
toreador red : 1
bright white clearcoat : 2
billet silver metallic clearcoat : 3
black clearcoat : 2
jazz blue pearlcoat : 1
purple : 1
ruby red metallic tinted clearcoat : 2
triple yellow tri-coat : 3
competition orange : 1
off-white : 2
shadow black : 5
magnetic metallic : 6
ingot silver metallic : 4
ruby red : 1
royal crimson metallic tinted clearcoat : 1
kona blue metallic : 1
oxford white : 4
lightning blue : 1
ingot silver : 1
white platinum tri-coat metallic : 2
guard : 1
tuxedo black metallic : 2
tan : 1
burgundy : 1
super black : 3
cayenne red : 2
morningsky blue : 1
pearl white : 1
glacier white : 1

In [ ]:
for state in df['state'].unique():
  print(state, ":",len(df[df['state']== state]))

new jersey : 87
tennessee : 26
georgia : 51
virginia : 90
florida : 246
texas : 214
california : 190
north carolina : 146
ohio : 31
new york : 58
pennsylvania : 299
south carolina : 64
michigan : 169
washington : 14
arizona : 33
utah : 10
kentucky : 9
massachusetts : 27
nebraska : 4
ontario : 7
missouri : 46
minnesota : 119
oklahoma : 71
connecticut : 25
indiana : 14
arkansas : 12
kansas : 4
wyoming : 1
colorado : 21
illinois : 113
wisconsin : 94
mississippi : 24
maryland : 4
oregon : 27
west virginia : 21
nevada : 85
rhode island : 2
louisiana : 11
alabama : 17
new mexico : 4
idaho : 2
new hampshire : 4
montana : 1
vermont : 2

In [ ]:
for year in df['year'].unique():
  print(year, ":",len(df[df['year']== year]))

2008 : 18
2011 : 23
2018 : 395
2014 : 104
2010 : 13
2017 : 377
2009 : 11
2013 : 86
2015 : 196
2020 : 48
2016 : 203
1973 : 1
2003 : 9
2019 : 892
2002 : 2
2000 : 4
2001 : 5
2005 : 6
2012 : 72
2006 : 8
2007 : 6
1998 : 4
2004 : 6
1994 : 2
1997 : 2
1996 : 2
1999 : 1
1984 : 1
1995 : 1
1993 : 1

In [ ]:
#This is whole code of cars analysis of Day-1